<script setup lang="ts">
import {PropType, ref} from "vue";
import NavLayout from "@/Layouts/NavLayout.vue";
import {Link} from "@inertiajs/vue3";
import AuthData = App.Data.AuthData;
import {DocFile} from "@/types/main";

const props = defineProps({
    auth: Object as PropType<AuthData>,
})

// 0 => Руководство предприятия
// 1 => История предприятия
// 2 => Структура Предприятия
// 3 => СИСТЕМА МЕНЕДЖМЕНТА
const selectedCategory = ref(0);
const docFiles: DocFile[] = [
    {
        title: 'Миссия и видение',
        url: 'https://www.granit.by/upload/iblock/490/1-missiya-i-videnie.pdf'
    },
    {
        title: 'Цели в области качества',
        url: 'https://www.granit.by/upload/iblock/a41/acxw3p374vefv5wz3p8zs2jknroessao/TSeli-v-oblasti-kachestva-2024.pdf'
    },
    {
        title: 'Сертификаты ISO 9001:2015',
        url: 'https://www.granit.by/upload/iblock/93c/_-ISO-9001_2015.pdf'
    },
    {
        title: 'Сертификат СТБ ISO 9001-2015',
        url: 'https://www.granit.by/upload/iblock/7ee/_-_-ISO-9001_2015-06_01_2022.pdf'
    },
    {
        title: 'Цели в области окружающей среды',
        url: 'https://www.granit.by/upload/iblock/687/e05nnfvv740f1ou53223jkjrwpk6kuv8/TSeli-v-oblasti-okruzhayushchey-sredy-2024.pdf'
    },
    {
        title: 'Сертификат соответствия системы менеджмента борьбы со взяточничеством',
        url: 'https://www.granit.by/upload/iblock/6b3/uc4nja541addgzc365y8za4g6z27chax/Sertifikat-sootvetstviya-sistemy-menedzhmenta-borby-so-vzyatochnichestvom.pdf'
    },
    {
        title: 'СЕРТИФИКАТ системы менеджмента окружающей среды (EN)',
        url: 'https://www.granit.by/upload/iblock/a07/2020_11_23-sertifikat-ekologicheskiy-ISO-14001-EN.jpg'
    },
    {
        title: 'СЕРТИФИКАТ системы менеджмента окружающей среды (RU)',
        url: 'https://www.granit.by/upload/iblock/fa7/2020_11_23-sertifikat-ekologicheskiy-ISO-14001-RU.jpg'
    },
    {
        title: 'СЕРТИФИКАТ СУОТ (RU)',
        url: 'https://www.granit.by/upload/iblock/4fb/2020_11_23-sertifikat-CUOT-ISO-45001-RU.jpg'
    },
    {
        title: 'СЕРТИФИКАТ СУОТ (EN)',
        url: 'https://www.granit.by/upload/iblock/292/2020_11_23-sertifikat-CUOT-ISO-45001-EN.jpg'
    },
    {
        title: 'Сертификат соответствия 100 ЛУЧШИХ ПРЕДПРИЯТИЙ ТС ЕАЭС',
        url: 'https://www.granit.by/upload/iblock/eec/z0priic5wnh2is6lhaw08myop2ezgmpn/Sertifikat-sootvetstviya-100-LUCHSHIKH-PREDPRIYATIY-TS-EAES.pdf'
    }
];
</script>

<template>
    <NavLayout title="О предприятии" :auth="auth">
        <div class="bg-white px-16 shadow-md pb-16">

            <!--Крошки-->
            <p class="text-gray-400 pt-8">
                <Link :href="route('home.index')">Главная</Link>
                /
                <Link :href="route('about.index')" class="text-black">О предприятии</Link>
            </p>

            <!--Описание-->
            <p class="pt-4 font-bold text-4xl">О предприятии</p>

            <!--Переключение категорий-->
            <div class="flex mt-4 space-x-4 pb-4 border-b-2">
                <button class="py-4 rounded-l-sm text-xl font-semibold w-full border-2"
                        @click="selectedCategory = 0"
                        :class="{'text-white bg-red-600 border-red-600': selectedCategory == 0,
                        'border-gray-300': selectedCategory != 0}">
                    Руководство предприятия
                </button>
                <button class="py-4 text-xl font-semibold w-full border-2"
                        @click="selectedCategory = 1"
                        :class="{'text-white bg-red-600 border-red-600': selectedCategory == 1,
                        'border-gray-300': selectedCategory != 1}">
                    История предприятия
                </button>
                <button class="py-4 text-xl font-semibold w-full border-2"
                        @click="selectedCategory = 2"
                        :class="{'text-white bg-red-600 border-red-600': selectedCategory == 2,
                        'border-gray-300': selectedCategory != 2}">
                    Структура предприятия
                </button>
                <button class="py-4 rounded-r-sm text-xl font-semibold w-full border-2"
                        @click="selectedCategory = 3"
                        :class="{'text-white bg-red-600 border-red-600': selectedCategory == 3,
                        'border-gray-300': selectedCategory != 3}">
                    Система менеджмента
                </button>
            </div>

            <!--Руководство предприятия-->
            <div class="flex space-x-24 mt-4" v-show="selectedCategory == 0">
                <div class="w-full">
                    <p class="font-semibold text-2xl">Гаврилкович Эдуард Геннадьевич</p>
                    <p class="mt-4">Генеральный директор РУПП «Гранит»</p>
                </div>
                <div class="w-full">
                    <p class="font-semibold text-2xl w-[16rem]">Батура Валерий Андреевич</p>
                    <p class="mt-4">Первый заместитель генерального директора - главный инженер РУПП «Гранит»</p>
                </div>
                <div class="w-full">
                    <p class="font-semibold text-2xl">Сероокая Маргарита Васильевна</p>
                    <p class="mt-4">Заместитель генерального директора по персоналу, социальным вопросам и
                        идеологической работе РУПП
                        «Гранит»</p>
                </div>
            </div>

            <!--История предприятия-->
            <div class="mt-4" v-show="selectedCategory == 1">
                <p style="text-align: justify; text-indent: 36pt;">Республиканское унитарное производственное
                    предприятие «Гранит» (РУПП «Гранит») является крупнейшим предприятием в Европе по добыче и
                    переработке плотных горных пород, находится в государственной собственности и подчиняется
                    Министерству архитектуры и строительства Республики Беларусь.</p>

                <p style="text-align: justify; text-indent: 36pt;">Сегодня мы выпускаем более 21 млн. тонн нерудных
                    строительных материалов в год.</p>

                <p style="text-align: justify; text-indent: 36pt;">Основная деятельность предприятия направлена на
                    обеспечение строительной индустрии строительными материалами:</p>

                <p style="text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">щебень
                    фракций 5-10 мм, 5-20 мм, 10-20 мм, 20-40 мм, 40-70 мм (ГОСТ 8267-93 «Щебень и гравий из плотных
                    горных пород для строительных работ»);</p>

                <p style="text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">щебень
                    фракции 25-60 мм (ГОСТ 7392-2002 «Щебень из плотных горных пород для балластного слоя
                    железнодорожного пути», ГОСТ Р 54748-2011 «Щебень из плотных горных пород для балластного слоя
                    железнодорожного пути»);</p>

                <p style="text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">отсев
                    фракции 0-5 мм (ТУ BY 200 161 167.003-2010 «Отсев из материалов дробления горных пород»);</p>

                <p style="text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">отсев
                    фракционированный фракций 0-0,63 мм, 0,63-2,5 мм, 2,5-5 мм (ТУ BY 200 161 167.004-2013 «Отсев
                    фракционированный из материалов дробления горных пород»);</p>

                <p style="text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">щебень
                    кубовидный фракции 5-10 мм (СТБ 1311-2002. «Щебень кубовидный из плотных горных пород»);</p>

                <p style="text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">щебень
                    европейских фракций 4/8 мм, 8/16, 4/16, 16/22, 16/31.5 (СТБ ЕН 12620-2010 «Заполнители для
                    бетона»);</p>

                <p style="text-align: justify; text-indent: 36pt;">щебеночно-песчаная смесь для дорожного строительства
                    марки С6 0-40 мм., С5 0-80 мм (СТБ 2318-2013 « Щебеночно-гравийно-песчаная смесь»);</p>

                <p style="text-align: justify; text-indent: 36pt;">скальная порода переработанная 0-300 мм (ТУ ВУ 200
                    161 167.005-2015 «Породы скальные переработанные»);</p>

                <p style="text-align: justify; text-indent: 36pt;">щебень фракция от 31.5 – 63 мм (СТБ ЕН 13450-2007
                    «Щебень для балластного слоя железнодорожного пути»).</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">
                    Продукция предприятия используется в качестве заполнителя для монолитных бетонов, сборных бетонных и
                    железобетонных конструкций, поверхностных обработок дорог, аэродромных покрытий и стоянок для
                    автомобильного транспорта, для гражданского и дорожного строительства, гидротехнического
                    строительства, для балластного слоя железнодорожного пути, благоустройства территорий, производства
                    элементов благоустройства, для укрепления дамб и других строительных работ. Высокое качество и
                    конкурентоспособность нашей продукции обеспечиваются за счёт стабильной работы предприятия,
                    применения современных технологий, новейшего оборудования и безупречной работы
                    высококвалифицированных кадров, а также благодаря своевременному выполнению договорных обязательств,
                    подтверждением чего является присуждение Премии Правительства Республики Беларусь за достижения в
                    области качества 2015. </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">
                    Сырьем для переработки являются горные породы месторождения «Микашевичи».</p>

                <p style="text-align: justify; text-indent: 36pt;">История месторождения начинается с 1963 года, когда
                    Южная белорусская экспедиция обнаружила большие запасы строительного камня и дала им название
                    Микашевичский выступ. Месторождение строительного камня «Микашевичи» расположено в 500 м к западу от
                    г. Микашевичи Лунинецкого района Брестской области. Детальные геологоразведочные работы на
                    месторождении «Микашевичи» впервые проведены в 1963 г. Месторождение имеет форму прямоугольника
                    общей площадью около 377 га. Рельеф месторождения равнинный, местами заболоченный с абсолютными
                    отметками от 129,2 м до 132,6 м. Вскрышные породы представлены в основном песками, мощность которых
                    колеблется от 7,3 до 60,2 м, в среднем по месторождению 30 м. Полезным ископаемым на месторождении
                    «Микашевичи» являются интрузивные кристаллические породы (строительный камень). Кристаллические
                    породы залегают на глубине от 7,3 м до 60,2 м и сложены следующими петрографическими разностями:
                    диоритами, гранодиоритами, гранитами. Строительный камень детально разведан на глубину 150 м. На эту
                    же глубину запроектирован карьер. Ниже дна карьера, на глубину до 210 м располагаются предварительно
                    оцененные запасы строительного камня, которые в перспективе могут быть доразведаны и отработаны.</p>

                <p style="text-align: justify; text-indent: 36pt;">Месторождение строительного камня «Микашевичи»
                    разрабатывается карьером «Микашевичи» с 1973 года. В настоящее время карьер «Микашевичи»
                    представляет собой самую большую открытую горную выработку в Центральной Европе. Карьер растянулся
                    на 2760 м с запада на восток и на 1770 севера на юг и состоит из 4 вскрышных и 11 добычных уступов.
                    Глубина карьерной выработки составляет 150 м, что на 20 м ниже уровня Балтийского моря. Система
                    разработки карьера транспортная с внешним отвалообразованием. На добычных и вскрышных работах
                    задействованы мощные экскаваторы с объемом ковша до 11 м<sup>3</sup>, на откатке горных пород
                    используются карьерные самосвалы грузоподъемностью до 90 т. За год карьер «Микашевичи» выдает
                    на-гора до 8 млн. м<sup>3</sup> полезного ископаемого и до 2 млн. м<sup>3 </sup> вскрышных пород.
                    Вскрышные породы складируются во внешних отвалах, которые размещаются вдоль южной и северной границ
                    месторождения. </p>

                <p style="text-align: justify; text-indent: 36pt;"> Проектирование комбината нерудных материалов
                    «Микашевичи» осуществлял Ленинградский институт «Союзгипронеруд», имеющий большой опыт в создании
                    предприятий строительной индустрии. </p>

                <p style="text-align: justify; text-indent: 36pt;">К концу <strong>1968</strong> года проектное задание
                    было разработано и утверждено Министерством строительных материалов СССР. Данная разработка включила
                    в себя двадцать один том проектной документации и вышла под следующими названиями:</p>

                <p style="text-align: justify; text-indent: 36pt;">проектное задание на строительство комбината нерудных
                    материалов «Микашевичи»;</p>

                <p style="text-align: justify; text-indent: 36pt;">проектное задание карьера и дробильно-сортировочного
                    завода «Микашевичи».</p>

                <p style="text-align: justify; text-indent: 36pt;">В мае 1971 года Госстрой СССР утвердил положение о
                    дирекции строящегося предприятия:</p>

                <p style="text-align: justify; text-indent: 36pt;">Приказ Министерства промышленности строительных
                    материалов БССР от 30.01.1976 г. № 19 «О создании комбината нерудных материалов «Микашевичи». В
                    связи с вводом в действие законченных строительных объектов первого пускового комплекса карьера и
                    дробильно-сортировочного завода «Микашевичи».</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">Комбинат нерудных
                    материалов «Микашевичи» (первое название предприятия) создавался на базе карьера «Микашевичи» и
                    дробильно-сортировочного завода «Микашевичи» по переработке строительного камня, Ситницкого
                    щебеночного завода и опытного карьера «Глушковичи». </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">Далее название предприятия
                    менялось:</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">производственное
                    объединение «Гранит»;</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">государственное предприятие
                    «Гранит»;</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">республиканское унитарное
                    предприятие «Гранит».</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"></p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"> В разные годы предприятием
                    руководили: Руденко И.В Пульянович С.В., Митрофанов Г.П., Попов В.И., Телков В.И., Батура В.А.,
                    Аутко В.Ф., Туровец С.П.</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">С 19.06.2012 генеральным
                    директором РУПП «Гранит» является Гаврилкович Э.Г.</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"></p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"> 21<strong> октября 1973
                    года</strong> был произведен первый взрыв мощностью не более двух тонн взрывчатого вещества (сейчас
                    производятся взрывы до 100 тонн и более), но именно он возвестил о рождении крупнейшего карьера в
                    Белоруссии.</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"><strong>29 декабря 1975
                    г.</strong> сдана первая очередь завода, </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"><strong>28 октября 1976
                    г.</strong> – вторая очередь завода, </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"><strong>19 сентября 1977
                    г.</strong> – третья очередь завода,</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">1986- четвертая
                    технологическая линия…</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"> Завод-гигант рос на
                    глазах... Строителям и эксплуатационникам пришлось приложить немало труда, настойчивости, чтобы было
                    все во время, несмотря на трудности, которые постоянно приходилось преодолевать.</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">Географическое положение
                    предприятия позволяло отправлять продукцию железнодорожным, автомобильным и водным транспортом. </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"> В <strong>1974
                    году</strong> началась отгрузка отсева и щебня водой по судоходному каналу, который соединил склады
                    с рекой Припять. </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"> В <strong>апреле
                    1976</strong> года началась отгрузка продукции по железной дороге. </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"><strong>В 1980 –
                    1981</strong> годах по данным детальной доразведки были определены промышленные запасы месторождения
                    в объеме 365 млн. м³, это обеспечивает работу РУПП «Гранит» при действующих мощностях более чем на
                    40 лет.</p>

                <p style="text-align: justify; text-indent: 36pt;"> В 2008 году введена в эксплуатацию линия по
                    переработке щебня фракции 20-40 мм для получения кубовидного щебня и линия по переработке отсевов из
                    материалов дробления с классификациям по 3 группам.</p>

                <p style="text-align: justify; text-indent: 36pt;"> С 2011 г. введена в строй пятая технологическая
                    линия. С ее пуском утвержденная мощность по щебню составила 16 000 тыс.тонн/год.</p>

                <p style="text-align: justify; text-indent: 36pt;"> С 11 июля 2012 года началась реализация
                    инвестиционного проекта «Строительство горнообогатительного комбината на базе месторождения
                    «Ситницкое» производственной мощностью по щебню 9 млн. тонн.</p>

                <p style="text-align: justify; text-indent: 36pt;"></p>

                <p style="text-align: justify; text-indent: 36pt;">За сорокалетнюю историю предприятия были построены
                    более 25 60-, 80-, 90- квартирных жилых домов в г.п. Микашевичи для рабочих и служащих предприятия.
                    Два детсада-ясли, больница на 100 мест, поликлиника на 300 мест, Дворец культуры, здание
                    профилактория «Свитанок» и его медико-оздоровительный корпус, два общежития, здание
                    физкультурно-оздоровительного комплекса, плавательный бассейн.</p>

                <p style="text-align: justify; text-indent: 36pt;">На территории предприятия были построены более 50
                    зданий и сооружений основных и вспомогательных цехов, гаражей, также здание столовой, здание
                    здравпункта, прачечной спецодежды.</p>

                <p style="text-align: justify; text-indent: 36pt;">Предприятием ежегодно проводятся реконструкции
                    устаревших конструкций, автомобильных дорог и капитальные ремонты помещений, зданий цехов,
                    корпусов.</p>

                <p style="text-align: justify; text-indent: 36pt;"></p>

                <p style="text-align: justify; text-indent: 36pt;"><b> Техпроцесс </b></p>

                <p style="text-align: justify; text-indent: 36pt;">РУПП «Гранит» - многофункциональный технологический
                    комплекс.</p>

                <p style="text-align: justify; text-indent: 36pt;">Технологический процесс производства щебня и отсева
                    сосредоточен в трёх основных структурных подразделениях:</p>

                <p style="text-align: justify; text-indent: 36pt;">• карьер «Микашевичи»;</p>

                <p style="text-align: justify; text-indent: 36pt;">• автотранспортный парк;</p>

                <p style="text-align: justify; text-indent: 36pt;">• дробильно-сортировочный завод.</p>

                <p style="text-align: justify; text-indent: 36pt;"></p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;"><b>Карьер «Микашевичи».</b>
                </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">Технологическая схема
                    разработки горных пород в карьере «Микашевичи» предусматривает ведение вскрышных, буровзрывных и
                    добычных работ. </p>

                <p style="text-align: justify; text-indent: 36pt;">Процесс добычи полезных ископаемых в карьере
                    «Микашевичи» состоит из трех этапов: вскрытие полезных ископаемых (цех Горный), подготовка горной
                    породы к выемке (Цех Буровзрывных работ), погрузка взорванной горной массы в автотранспорт, откачка
                    притока грунтовых вод (Цех Горный). </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">Цех Горный занимается
                    удалением вскрышных пород (растительный слой, песчаная вскрыша, скальная вскрыша) для вскрытия
                    полезного ископаемого. Вскрышные породы отгружаются в автотранспорт для вывозки во внешние отвалы.
                    Мощность удаляемых вскрышных пород составляет от 8 до 60 метров. После окончания отсыпки отвалов
                    производят выполаживание откосов и отсыпку площадей растительным слоем, снятым перед вскрышными
                    работами, с целью выполнения рекультивации. </p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt;">Применяемая техника:
                    экскаваторы ЭШ-11/70, ЭКГ-5А, ЭДГ-3.2-30, бульдозеры-Т-330, Т-25, БелАЗ-7822, погрузчик
                    БелАЗ-7823.</p>

                <p style="text-align: justify; text-indent: 36pt;">Цех Буровзрывных работ производит бурение скважин
                    диаметром 250 мм, 244,5мм, 215мм, бурение шпуров Ø 40мм в негабаритных кусках, их последующую
                    зарядку взрывчатыми веществами и взрывание монолита и негабаритных кусков. Конечная цель его работы
                    состоит в подготовке к экскавации достаточного для переработки количества горной массы. За год
                    производится более 100 массовых взрывов. Применяются бурстанки СБШ - 250МНА, МНА-32, автотракторная
                    и бульдозерная техника, а также автомобили для зарядки и забойки скважин.</p>

                <p style="text-align: justify; text-indent: 36pt;"> Цех Горный производит добычные работы, состоящие из
                    погрузки горной массы из забоев в автотранспорт для транспортировки на дробильно-сортировочный
                    завод, устройство карьерных дорог, съездов, зумпферов, кюветов, обеспечивает работы водоотливных
                    установок. Откачка суточного притока грунтовых вод и атмосферных осадков составляет 65 тыс.
                    м<sup>3</sup>.Для откачки воды с нижних горизонтов используются насосы АЦН -1000/180.
                    Производительность по отгрузке взорванной массы составляет более 60 тыс. тонн в сутки. В цехе
                    работает мощная горнотранспортная техника: экскаваторы ЭКГ-8И, ЭКГ-10, ЭКГ-5А, бульдозеры Т-330,
                    погрузчик БелАЗ-7822, бульдозер БелАЗ-7823. Для разрушения негабаритных кусков горной массы
                    используется гидравлический экскаватор «HYUNDAI ROBER 450 LC-7» с навесным оборудованием гидромолот,
                    который разрушает негабаритные куски энергией механического удара.</p>

                <p style="text-align: justify; text-indent: 36pt;"></p>

                <p style="text-align: justify; text-indent: 36pt;"><b>Автотранспортный парк.</b></p>

                <p style="text-align: justify; text-indent: 36pt;">Автотранспортный парк представляет собой одно из
                    сложнейших подразделений РУПП «Гранит». Он является связующим звеном между карьером и
                    дробильно-сортировочным заводом.</p>

                <p style="text-align: justify; text-indent: 36pt;">На самом сложном и интенсивном участке трудится
                    первая транспортная колонна. В её распоряжении 61 автомобиль БелАЗ грузоподъемностью 50, 55, 60, 90
                    тонн.</p>

                <p style="text-align: justify; text-indent: 36pt;">Водители 2 колонны задействованы в
                    материально-техническом снабжении предприятия. Они обеспечивают грузовые и пассажирские перевозки по
                    местным, междугородним и международным маршрутам. </p>

                <p style="text-align: justify; text-indent: 36pt;">За 2-й колонной закреплены автокраны, легковой
                    транспорт, автобусы, автовышки, автомобили по перевозке ГСМ и взрывчатых веществ, МАЗы для
                    междугородных перевозок.</p>

                <p style="text-align: justify; text-indent: 36pt;">Техника третьей колонны, где сосредоточены колесные и
                    гусеничные бульдозеры, погрузчики на базе БелАЗов и тракторы, обеспечивает бесперебойную и
                    непрерывную работу предприятия по выпуску щебня, погрузке продукции, содержанию дорог и выполнение
                    прочих работ.</p>

                <p style="text-align: justify; text-indent: 36pt;"></p>

                <p style="text-align: justify; text-indent: 36pt;"><b> Дробильно-сортировочный завод.</b></p>

                <p style="text-align: justify; text-indent: 36pt;">В состав дробильно-сортировочного завода входят пять
                    цехов по переработке горной массы и производству щебня, один цех погрузки и два вспомогательных
                    участка.</p>

                <p style="text-align: justify; text-indent: 36pt;"> Привезенную из карьера горную массу размером
                    0-1200мм цеха перерабатывают на щековых дробилках С-200(Финляндия), СМД-117, ЩДП 15х21(Россия).</p>

                <p style="text-align: justify; text-indent: 36pt;">Горная масса 0-300 мм конвейерным транспортом
                    подается на дробилки среднего дробления КСД-2200(Россия), НР-500(Франция), дробится на размер горной
                    массы от 0 до 90 мм и подается конвейерным транспортом в корпус третичного дробления.</p>

                <p style="text-align: justify; text-indent: 36pt;">Принятая горная масса перерабатывается на конусных
                    дробилках НР-300, НР-500 (Франция), КМД-2200(Россия) размером от 0 до 70 мм и подается в корпус
                    сортировки, где проходит грохочение на различные фракции.</p>

                <p style="text-align: justify; text-indent: 36pt;"> Складирование готовой продукции осуществляется в
                    штабельные склады.</p>

                <p style="text-align: justify; text-indent: 36pt;"> Отгрузка готовой продукции производится в
                    железнодорожный, автомобильный и водный транспорт.</p>

                <p style="text-align: justify; text-indent: 36pt;">Весь технологический процесс переработки горной массы
                    на заводе автоматизирован. Управление и контроль за ходом процесса осуществляется с центрального
                    пульта дробильно-сортировочного завода.</p>

                <p style="text-align: justify; text-indent: 36pt;">Выпуск щебня различных фракций сориентирован на
                    обеспечение строительной индустрии Республики Беларусь строительным материалом - щебнем из плотных
                    горных пород. Структуры щебня устойчивы против всех видов распадов. Прочность щебня по дробимости
                    характеризуется маркой 1400, по истираемости - И1, морозостойкость - 300.</p>

                <p style="text-align: justify; text-indent: 36pt;"></p>

                <p style="text-align: justify; text-indent: 36pt;"><b>ЛМЦ</b></p>

                <p style="text-align: justify; text-indent: 36pt;"> В 1983 году был построен литейный цех, который
                    является основным поставщиком запасных частей из стали 110Г13Л и 35Л для размольно-дробильного и
                    горнодобывающего оборудования. Производственная мощность ЛМЦ - <strong>1000 тонн литья в
                        год</strong>.</p>

                <p style="text-align: justify; text-indent: 36pt;">Собственный модельный участок позволяет в минимальные
                    сроки изготавливать оснастку для выпуска несложных отливок по индивидуальным чертежам заказчика. Для
                    выплавки стали установлены две электроплавильные печи ДСП-3.</p>

                <p style="text-align: justify; text-indent: 36pt;">На оборудовании ЛМЦ имеется возможность производить
                    механическую обработку литья.</p>

                <p style="text-align: justify; text-indent: 36pt;"></p>

                <p style="text-align: justify; text-indent: 36pt;">Не последнюю роль в технологическом процессе играют и
                    вспомогательные цеха предприятия: КИПиА, ремонтно-механический, электроцех, цех паросилового
                    хозяйства, ремонтно-строительный и другие.</p>

                <p style="text-align: justify; text-indent: 36pt;"> Для поддержания нравственного и физического здоровья
                    многотысячного коллектива РУПП «Гранит» на предприятии десятилетиями создавалась и обслуживалась
                    большая социальная инфраструктура, включающая Дворец культуры, бассейн, санаторий «Свитанок», ФОК,
                    стадион, два общежития. В декабре 2015 года был создан музей РУПП «Гранит».</p>

                <p style="text-align: justify; text-indent: 36pt;">За последние годы часть этой социальной сферы была
                    передана на баланс Микашевичского ЖКХ.</p>

                <p style="text-align: justify; text-indent: 36pt;">В 2017 году была открыта новая просторная столовая
                    предприятия с новейшим оборудованием. Налажена работа еще двух небольших цеховых столовых,
                    буфета.</p>

                <p style="text-align: justify; text-indent: 36pt;">Для активного досуга рабочих, служащих и их детей за
                    последние годы предприятием было сделано многое:</p>

                <p style="text-align: justify; text-indent: 36pt;">- открыт уличный физкультурно-спортивный комплекс с
                    зоной активного отдыха на территории ДК;</p>

                <p style="text-align: justify; text-indent: 36pt;">-открыта детская игровая площадка с электромобилями,
                    батутами, надувными горками;</p>

                <p style="text-align: justify; text-indent: 36pt;">-открыт детский игровой комплекс «Муравейник»;</p>

                <p style="text-align: justify; text-indent: 36pt;">- в зимнее время заливается каток и налажена работа
                    по прокату зимнего спортивного инвентаря.</p>

                <p style="text-align: justify; text-indent: 36pt;">Во Дворце культуры РУПП «Гранит» налажена и
                    проводится на высоком уровне круглогодичная театрализованная программа для зрителей всех
                    возрастов.</p>

                <p style="text-align: justify; text-indent: 36pt;">Ежегодно проводятся разные многоборья по различным
                    видам спорта, туристический слет РУПП «Гранит».</p>

                <p style="text-align: justify; text-indent: 36pt;">Так же, во Дворце культуры, успешно работают
                    различные коллективы: инструментальные вокально-хоровые, театрально-драматические, хореографические.
                    А также 5 детских и 3 взрослых коллектива художественной самодеятельности.</p>

                <p style="text-align: justify; text-indent: 36pt;"> РУПП «Гранит» ежегодно проводит молодежный
                    музыкальный фестиваль «Мы едины – мы молодежь».</p>

                <p style="text-align: justify; text-indent: 36pt;"> Предприятие выпускает свою малотиражную газету
                    «Гранит-обозрение». Она ежемесячно информирует коллектив о деятельности администрации, рассказывает
                    рабочим и служащим о буднях родного предприятия, его лучших людях, знакомит со спецификой работы
                    отдельных подразделений, анонсирует мероприятия, организуемые руководством и профсоюзной
                    организацией.</p>

                <p style="text-align: justify; text-indent: 36pt;"> Ежегодно рабочие, служащие и администрация
                    предприятия совместно с профсоюзной организацией РУПП «Гранит», ОО «БРСМ», РОО «Белая Русь» в канун
                    новогодних праздников проводят благотворительные акции «Подари детям тепло» для детей-сирот
                    Социально-педагогического центра с детским приютом в г. Лунинце и для детей Микашевичского филиала
                    ГУ «Лунинецкий территориальный центр социального обслуживания населения».</p>

                <p style="text-align: justify; text-indent: 36pt;"> С особой теплотой и вниманием относятся на РУПП
                    «Гранит» к ветеранам Великой Отечественной войны и труда. Главным направлением работы предприятия c
                    ними является оказание им социальной помощи и содействие по улучшению материального благосостояния.
                    Ежегодно предприятие чествует ветеранов войны и труда в день пожилых людей, в День Победы и День
                    Независимости Республики Беларусь, а также в день предприятия. Для них организовываются праздничные
                    мероприятия, посвященные историческим датам, торжественные приемы, экскурсии по предприятию.
                    Проходит награждение ветеранов производства нагрудным знаком РУПП «Гранит», «Ганаровы работнiк» РУВП
                    «Гранiт», а также грамотами.</p>

                <p style="text-align: justify; text-indent: 36pt;"> РУПП «Гранит» с заботой и вниманием относится и к
                    передовикам производства, они тоже получают достойное поощрение.</p>

                <p style="text-align: justify; text-indent: 36pt;">На предприятии предусмотрены следующие виды
                    поощрений:</p>

                <p style="text-align: justify; text-indent: 36pt;">– Почетная грамота (может выдаваться не чаще, чем
                    один раз в три года).</p>

                <p style="text-align: justify; text-indent: 36pt;">– звание «Лучший по профессии» (не чаще, чем один раз
                    в пять лет).</p>

                <p style="text-align: justify; text-indent: 36pt;">– звание «Ветеран труда III, II или I степени» (за
                    отработанный стаж 20, 25 и 30 лет соответственно).</p>

                <p style="text-align: justify; text-indent: 36pt;">По состоянию на начало 2017 года 52 рабочих и
                    служащих были отмечены высшей наградой предприятия – нагрудным знаком «Ганаровы работнiк» РУВП
                    «Гранiт». Она присваивается за образцовое исполнение профессиональных обязанностей, высокие
                    достижения в труде.</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">
                    Бронзовый призер XI чемпионата Беларуси по футзалу футбольная команда «Гранит» успешно принимает
                    участие в играх высшей лиги республиканского чемпионата по мини-футболу.</p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">
                    Сборная команда РУПП «Гранит» не раз становилась призёром республиканских соревнований:
                    «Республиканской спартакиады районов, пострадавших от аварии на ЧАЭС», Республиканских соревнований
                    базовых коллективов физкультуры «Спорт для всех», «Республиканской отраслевой спартакиады работников
                    строительства и промстройматериалов» и т.д.</p>

                <p style="text-align: justify; text-indent: 36pt;"> Сегодня РУПП «Гранит» – многофункциональный
                    технологический комплекс. В производственном процессе используется мощное современное
                    горно-выемочное, буровое, транспортное и дробильно-сортировочное оборудование ведущих
                    производителей. В результате горная порода превращается в высококачественный строительный
                    продукт.</p>

                <p style="text-align: justify; text-indent: 36pt;"> На протяжении сорока лет здесь трудится не одно
                    поколение наших земляков. Глядя на это крупнейшее в Европе месторождение камня, осознаешь масштаб и
                    мощь РУПП «Гранит». Чтобы сделать его процветающим, тысячи специалистов и рабочих вложили в него
                    свои силы, знания и опыт. Слаженная работа всех структурных подразделений РУПП «Гранит» позволяет
                    формировать производственную дисциплину, совершенствовать организацию производства, повышать
                    конкурентоспособность предприятия.</p>

                <p class="MsoNormal" style="text-align: justify; text-indent: 36pt;"></p>

                <p style="text-indent: 36pt;"></p>

                <p></p>

                <p style="margin: 0 0 0.0001pt; text-align: justify; text-indent: 36pt; line-height: 15.75pt; background: white;">
                    &nbsp; &nbsp; РУПП «Гранит» является надежным партнёром для отечественных и зарубежных потребителей.
                    В числе клиентов предприятия крупнейшие отечественные и иностранные фирмы дорожно-строительного и
                    строительного комплексов, железнодорожники, мостостроители и другие.</p>

                <p style="text-align: justify; text-indent: 36pt;"></p>
            </div>

            <!--Структура Предприятия-->
            <div class="mt-4" v-show="selectedCategory == 2">
                <p class="text-xl font-semibold">Генеральный директор</p>
                <ul class="list-outside list-disc ml-4 mt-2">
                    <li>заместитель генерального директора по капитальному строительству-начальник отдела капитального
                        строительства&nbsp; &nbsp; &nbsp;&nbsp;<br>
                        (РСЦ, ОКС);
                    </li>
                    <li>заместитель генерального директора по снабжению <br>
                        (отдел МТСиКО, участок ЦМС, участок ГСМ, участок реализации перспективных проектов и НИР,
                        хранению ТМЦ);
                    </li>
                    <li>заместитель генерального директора по персоналу, социальным вопросам и идеологической работе
                        <br>
                        (санаторий «Свитанок», прачечная, служба бытового обслуживания,&nbsp;швейный участок, столовая,
                        плавательный бассейн, Дворец Культуры,&nbsp;музей, секретарь, пресс-секретарь);
                    </li>
                    <li>заместитель генерального директора по режиму, охранной деятельности и безопасности <br>
                        (общий отдел,&nbsp;отдел организации закупок);
                    </li>
                    <li>заместитель генерального директора по безопасности, режиму и кадрам (команда военизированной
                        охраны, служба экономической безопасности, сторожевая охрана, отдел кадров,&nbsp;ведущий
                        специалист по защите персональных данных);<br>
                    </li>
                    <li>заместитель генерального директора по внешнеэкономической деятельности, маркетингу и сбыту <br>
                        (отдел сбыта и планирования железнодорожных перевозок, бюро по реализации&nbsp;продукции по
                        территории Республики Беларусь, отдел по маркетингу и договорной работе, начальник управления по
                        качеству, сертификации, стандартизации и охране окружающей среды, отдел менеджмента качества,
                        сертификации и окружающей среды, испытательное подразделение);
                    </li>
                    <li>главный бухгалтер <br>
                        (бухгалтерия);
                    </li>
                    <li>заместитель генерального директора по экономике и инвестициям<br>
                        (плановый отдел, служба по труду, финансовый отдел, ИВО);
                    </li>
                    <li>начальник юридического отдела&nbsp;<br>
                        (юридический отдел)
                    </li>
                </ul>
                <p class="text-xl font-semibold mt-4">Первый заместитель генерального директора - главный инженер</p>
                <ul class="list-outside list-disc ml-4 mt-2">
                    <li>заместитель главного инженера по производству <br>
                        (дробильно-сортировочный завод, гранитный карьер «Микашевичи», автотранспортный парк,
                        литейно-механический цех, производственный отдел);
                    </li>
                    <li>заместитель главного инженера по охране труда и промышленной безопасности-начальник отдела
                        охраны труда и промышленной безопасности <br>
                        (отдел охраны труда и промышленной безопасности, служба производственного контроля);
                    </li>
                    <li>заместитель главного инженера по автоматизации и метрологии <br>
                        (цех КИПиА, служба видеонаблюдения за технологическим процессом предприятия);
                    </li>
                    <li>главный механик <br>
                        (отдел главного механика, литейно-механический цех, участок ТСРГПМ);
                    </li>
                    <li>главный энергетик <br>
                        (отдел главного энергетика, электроцех, цех паросилового хозяйства, высоковольтная испытательная
                        лаборатория);
                    </li>
                    <li>главный маркшейдер<br>
                        (маркшейдерский&nbsp;отдел)
                    </li>
                    <li>начальник технического отдела<br>
                        (технический отдел)
                    </li>
                </ul>
            </div>

            <!--СИСТЕМА МЕНЕДЖМЕНТА-->
            <div class="mt-4 grid grid-cols-3 gap-4" v-show="selectedCategory == 3">
                <a :href="docFile.url" class="p-2 flex items-center" target="_blank" v-for="docFile in docFiles">
                    <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5"
                         stroke="currentColor" class="min-w-16 min-h-16 max-w-16 max-h-16 text-red-600">
                        <path stroke-linecap="round" stroke-linejoin="round"
                              d="M19.5 14.25v-2.625a3.375 3.375 0 0 0-3.375-3.375h-1.5A1.125 1.125 0 0 1 13.5 7.125v-1.5a3.375 3.375 0 0 0-3.375-3.375H8.25m0 12.75h7.5m-7.5 3H12M10.5 2.25H5.625c-.621 0-1.125.504-1.125 1.125v17.25c0 .621.504 1.125 1.125 1.125h12.75c.621 0 1.125-.504 1.125-1.125V11.25a9 9 0 0 0-9-9Z"/>
                    </svg>
                    <div class="block">
                        <p class="font-semibold">{{ docFile.title }}</p>
                    </div>
                </a>
            </div>
        </div>
    </NavLayout>
</template>

<style scoped>

</style>
